machv/esp8266-irrigator/src/main.cpp
#include <FS.h> // FS needs to be the first
#include <Arduino.h>
#include <WiFiManager.h>
#include <ESP8266WebServer.h>
#include <PubSubClient.h> // MQTT server library
#include <EasyButton.h>
#include <ArduinoJson.h>
#include <Ticker.h> // for LED status indications
#include "settings.h" // Application settings
#include "FlowMeter.h" // Flow meter

// HW mapping
#define PinMeter1 D5
#define PinMeter2 D6
#define PinRelay1 D2
#define PinRelay2 D3
#define PinButton1 D7
#define PinButton2 D4
#define PinLed1 D0
#define PinLed2 D1
#define PinLedStatus D8

// Pin arrays
const uint8_t BUTTON_PINS[RELAYS_COUNT] = { PinButton1, PinButton2 };
const uint8_t LED_PINS[RELAYS_COUNT] = { PinLed1, PinLed2 };
const uint8_t RELAY_PINS[RELAYS_COUNT] = { PinRelay1, PinRelay2 };
const uint8_t METER_PINS[RELAYS_COUNT] = { PinMeter1, PinMeter2 };

// schedules LED blinking
Ticker ticker;

// Management web interface
ESP8266WebServer server(80);
#define CSS_FILE "/style.css"
#define JS_FILE "/scripts.js"

// Configuration
const char *ConfigFileName = "/config.json";
Configuration Config; 

// MQTT
WiFiClient espClient;
PubSubClient mqttClient(espClient);
unsigned long lastMqttConnectionRetryTime;
unsigned long mqttReconnectDelay = 30000;
String mqttLwtTopic;
String mqttTopicRelayStatus[RELAYS_COUNT];
String mqttTopicRelayCommand[RELAYS_COUNT];
bool relayState[RELAYS_COUNT];

EasyButton buttons[RELAYS_COUNT] = { 
  EasyButton(PinButton1), 
  EasyButton(PinButton2) 
};

FlowMeter meters[RELAYS_COUNT] = {
  FlowMeter(PinMeter1),
  FlowMeter(PinMeter2)
};

// The hall-effect flow sensor outputs approximately 4.5 pulses per second per
// litre/minute of flow.
float calibrationFactor = 4.5;

// millis when relays should be turned off
unsigned long relayTimeoutWhen[RELAYS_COUNT];

File GetFile(String fileName) {
  File file;
  if (SPIFFS.exists(fileName)) {
    file = SPIFFS.open(fileName, "r");
  }
  return file;
}

// Configuration handling
void readConfigurationFile() {
  // set defaults
  for(int i = 0; i < RELAYS_COUNT; i++) {
    Config.relays[i].name = String("Relay " + i);
    Config.relays[i].timeout = 0;
  }

  // read config file
  if(SPIFFS.exists(ConfigFileName))
  {
    Serial.println("Reading existing configuration.");

    File configFile = SPIFFS.open(ConfigFileName, "r");

    StaticJsonDocument<512> json;
    DeserializationError error = deserializeJson(json, configFile);
    if (error) {
      Serial.println(F("Failed to read file, using default configuration"));
      return;
    }

    // Copy values from the JsonDocument to the Config
    // https://arduinojson.org/v6/example/config/
    Config.mqtt_port = json["mqtt_port"] | 1883;
    Config.mqtt_server = json["mqtt_server"].as<String>();
    Config.mqtt_user = json["mqtt_user"].as<String>();
    Config.mqtt_password = json["mqtt_password"].as<String>();
    Config.mqtt_channel_prefix = json["mqtt_channel_prefix"].as<String>();
    
    if(json.containsKey("relays")) {
      JsonArray relays = json["relays"].as<JsonArray>();
      if(!relays.isNull()) {
        int i = 0;
        for(JsonObject relay : relays) {
          Config.relays[i].name = relay["name"].as<String>();
          Config.relays[i].timeout = json["timeout"] | 0;
          i++;
        }
      }
    }

    configFile.close();
  }
}

void saveConfigurationFile() {
  Serial.println("Saving configuration file.");

  File configFile = SPIFFS.open(ConfigFileName, "w");

  // Use arduinojson.org/assistant to compute the capacity.
  StaticJsonDocument<640> jsonDocument;

  // Set global values 
  jsonDocument["mqtt_server"] = Config.mqtt_server;
  jsonDocument["mqtt_port"] = Config.mqtt_port;
  jsonDocument["mqtt_user"] = Config.mqtt_user;
  jsonDocument["mqtt_password"] = Config.mqtt_password;
  jsonDocument["mqtt_channel_prefix"] = Config.mqtt_channel_prefix;

  // and per relay
  JsonArray relays = jsonDocument.createNestedArray("relays");
  for(int i = 0; i < RELAYS_COUNT; i++) {
    JsonObject relay = relays.createNestedObject();
    relay["name"] = Config.relays[i].name;
    relay["timeout"] = Config.relays[i].timeout;
  }

  // Serialize JSON to file
  if (serializeJson(jsonDocument, configFile) == 0) {
    Serial.println(F("Failed to write settings file."));
  }

  // Close the file
  configFile.close();
}

void tickStatusLed() {
  //toggle state
  int state = digitalRead(PinLedStatus);  // get the current state of GPIO1 pin
  digitalWrite(PinLedStatus, !state);     // set pin to the opposite state

  Serial.println("Status LED tick.");
}

void toggleRelay(int id) {
  uint8_t relayPin = RELAY_PINS[id];
  uint8_t ledPin = LED_PINS[id];
  String channel = mqttTopicRelayStatus[id];

  int currentValue = digitalRead(relayPin);
  int newValue = !currentValue;

  Serial.printf("Toggling relay #%i from %i to %i", id, currentValue, newValue);
  Serial.println();

  // Do the toggle
  // HIGH (0x1) = OFF, LOW (0x0) = ON
  digitalWrite(relayPin, newValue); // relay
  digitalWrite(ledPin, !newValue); // led
  
  relayState[id] = !newValue;

  if(relayState[id] && Config.relays[id].timeout > 0) { // if enabling and is timeout set, activate
    relayTimeoutWhen[id] = millis() + (Config.relays[id].timeout * 60 * 1000);
  } else {
    relayTimeoutWhen[id] = 0;
  }

  // And publish state update via MQTT
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Publishing updated state after toggle.");

    String value = String(relayState[id]);
    mqttClient.publish(channel.c_str(), value.c_str());
  }
}

void mqttSubscriptionCallback(char* topic, byte* payload, unsigned int length) {
  // report to terminal for debug
  Serial.print("[MQTT] Received message in topic '");
  Serial.print(topic);
  Serial.print("' with content: ");
  for (uint i = 0; i < length; i++) {
    Serial.print((char)payload[i]);
  }
  Serial.println();

  for(int i = 0; i < RELAYS_COUNT; i++) {
    if (strcmp (mqttTopicRelayCommand[i].c_str(), topic) == 0 && length > 0) {
      Serial.printf("[MQTT] State of relay %i requested to %c", (i + 1), payload[0]);

      if(
        ((payload[0] == '1' || (strcmp((char *)payload, "ON")  == 0) ) && relayState[i] == false) ||
        ((payload[0] == '0' || (strcmp((char *)payload, "OFF") == 0) ) && relayState[i] == true)
      ) {
        Serial.printf(", current state %i differs -> toggle.", relayState[i]);
       
        toggleRelay(i);
      } else {
        Serial.print(" already current state.");
      }

      Serial.println();
      return;
    }
  }

