machv/esp8266-irrigator/src/main.cpp
  // If we get here, we've not matched anything in loop above
  Serial.println("[MQTT] No match for any action.");
}

void setupMqtt(int retries) { 
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Disconnecting...");

    // publish offline status to LWT (as when gracefully Disconnecting no LWT is sent)
    mqttClient.publish(mqttLwtTopic.c_str(), "Offline", true);

    // and gracefully disconnect
    mqttClient.disconnect();
  }

  if(Config.mqtt_server.length() == 0) {
    return; // no server, no connection needed
  }
  
  mqttLwtTopic = String(Config.mqtt_channel_prefix + "status");
  for(int i = 0; i < RELAYS_COUNT; i++) {
    // in MQTT relays are numbered starting with 1, not 0
    mqttTopicRelayStatus[i] = String(Config.mqtt_channel_prefix + "state/" + (i + 1));
    mqttTopicRelayCommand[i] = String(Config.mqtt_channel_prefix + "command/" + (i + 1)) + "/power";
  }

  mqttClient.setServer(Config.mqtt_server.c_str(), Config.mqtt_port);
  mqttClient.setCallback(mqttSubscriptionCallback);

  const char *mqtt_user = nullptr;
  const char *mqtt_password = nullptr;
  if (Config.mqtt_user.length() > 0) 
    mqtt_user = Config.mqtt_user.c_str();
  if (Config.mqtt_user.length() > 0) 
    mqtt_password = Config.mqtt_password.c_str();

  // Build Client ID from MAC Address
  uint32_t chipId = ESP.getChipId();
  char clientId[20];
  snprintf(clientId, 20, "Zavlazovac-%08X", chipId);

  int retryCount = 0;
  while (!mqttClient.connected() && retryCount < retries) {
      Serial.printf("[MQTT] Connecting (retry %d of %d) with identity %s...", (retryCount + 1), retries, clientId);
      Serial.println();
  
      bool connectionState = false;
      connectionState = mqttClient.connect(clientId, mqtt_user, mqtt_password, mqttLwtTopic.c_str(), 1, true, "Offline");
      
      if (connectionState) {
        Serial.println("[MQTT] Connected successfully.");  

        // publish online status to LWT
        mqttClient.publish(mqttLwtTopic.c_str(), "Online", true);
      } else {
        Serial.print("[MQTT] Connection failed with code: ");
        Serial.println(mqttClient.state());

        if(retryCount > 0) { // delay only if more retries are requested
          delay(1000);
        }
      }

      retryCount++;
  }

  // And subscribe to respective channels
  if(mqttClient.connected()) {
    for(int i = 0; i < RELAYS_COUNT; i++) {
      Serial.printf("[MQTT] Publishing current state of relay %d.\n", i);
      String value = String(relayState[i]);
      mqttClient.publish(mqttTopicRelayStatus[i].c_str(), value.c_str());

      Serial.printf("[MQTT] Subscribing to the command channel: %s\n", mqttTopicRelayCommand[i].c_str());
      mqttClient.subscribe(mqttTopicRelayCommand[i].c_str());
    }
  }

  lastMqttConnectionRetryTime = millis();
}

void reconnectMqtt() {
  setupMqtt(5); // By default try 5-times before gave up
}

// Gets called when WiFiManager enters configuration mode
void configModeCallback (WiFiManager *myWiFiManager) {
  Serial.println("Entered config mode");
  Serial.println(WiFi.softAPIP());
  //if you used auto generated SSID, print it
  Serial.println(myWiFiManager->getConfigPortalSSID());
  
  //entered config mode, make led toggle faster
  ticker.attach(0.2, tickStatusLed);
}

char * millisToString(unsigned long millis) {
  unsigned long seconds = millis / 1000;
  static char str[12];
  long h = seconds / 3600;
  seconds = seconds % 3600;
  int m = seconds / 60;
  int s = seconds % 60;
  sprintf(str, "%02ld:%02d:%02d", h, m, s);
 
  return str;
}

void handle_cssFile() {
  File cssFile = GetFile(CSS_FILE);
  server.streamFile(cssFile, "text/css");
  cssFile.close();
}

void handle_jsFile() {
  File jsFile = GetFile(JS_FILE);
  server.streamFile(jsFile, "text/css");
  jsFile.close();
}

void handle_notFound() {
  server.send(404, "text/plain", "Not found");
}

String generateSettingsHtml(){
  Serial.println("[HTTP] Sending /config page.");

  String ptr = "<!DOCTYPE html> <html>\n";
  ptr += "<head><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  ptr += "<title>Zavlažovač / Settings</title>\n";
  ptr += "<link href=\"/style.css\" type=\"text/css\" rel=\"stylesheet\"/>\n";
  ptr += "</head>\n";
  ptr += "<body><div class=\"page\">\n";
  ptr += "<h1>Zavlažovač</h1>\n";
  ptr += "<h2>Settings</h2>\n";
  
  if(server.hasArg("saved")) {
    ptr += "<div class=\"alert-box\">Configuration was saved.</div>";
  }

  ptr +="<form method=\"post\" enctype=\"application/x-www-form-urlencoded\">\n";
  ptr +="<table>\n";

  for(int i = 0; i < RELAYS_COUNT; i++) {
    String id = String(i);

    ptr += ""
      "   <tr>\n"
      "     <th colspan=\"2\" class=\"settings-cell\">Relay " + String(i + 1) + "</th>\n"
      "   </tr>\n"
      "  <tr>\n"
      "    <th>Name</th>\n"
      "    <td><input type=\"text\" name=\"relay_"+ id + "_name\" value=\"" + (Config.relays[i].name) + "\"></td>\n"
      "  </tr>\n"
      "  <tr>\n"
      "    <th>Timeout</th>\n"
      "    <td><input type=\"text\" name=\"relay_" + id + "_timeout\" value=\"" + (Config.relays[i].timeout) + "\"> min.<div class=\"small\">In minutes, 0 means no timeout.</div></td>\n"
      "  </tr>\n";
  }

   ptr += ""
    "<tr>"
    "<th colspan=\"2\" class=\"settings-cell\">MQTT Settings</th>"
    "</tr>"
    "  <tr>\n"
    "    <th>Server</th>\n"
    "    <td><input type=\"text\" name=\"mqtt_server\" value=\"" + (Config.mqtt_server) + "\"></td>\n"
    "  </tr>\n"

    "  <tr>\n"
    "    <th>Port</th>\n"
    "    <td><input type=\"text\" name=\"mqtt_port\" value=\"" + (Config.mqtt_port) + "\"></td>\n"
    "  </tr>\n"

    "  <tr>\n"
    "    <th>User</th>\n"
    "    <td><input type=\"text\" name=\"mqtt_user\" value=\"" + (Config.mqtt_user) + "\"></td>\n"
    "  </tr>\n"

      "  <tr>\n"
    "    <th>Password</th>\n"
    "    <td><input type=\"password\" name=\"mqtt_password\" value=\"" + (Config.mqtt_password) + "\"></td>\n"
    "  </tr>\n"

    "  <tr>\n"
    "    <th>Channel prefix</th>\n"
    "    <td><input type=\"text\" name=\"mqtt_channel_prefix\" value=\"" + (Config.mqtt_channel_prefix) + "\"></td>\n"
    "  </tr>\n"

    "  <tr>\n"
    "    <th class=\"settings-cell\" colspan=\"2\"><input class=\"button\" type=\"submit\" value=\"Save Changes\"></th>\n"
    "  </tr>\n"

    "  <tr>\n"
    "    <th class=\"settings-cell\" colspan=\"2\"><a href=\"/\" class=\"button\">Back</a></th>\n"
    "  </tr>\n"
    "</table>\n"
    "</form>\n"
    "</body>\n"
    "</html>\n";
  
  return ptr;
}

String generateJsonApiResponse() {
   StaticJsonDocument<640> jsonDocument;
  
  JsonArray relays = jsonDocument.createNestedArray("relays");
  for(int i = 0; i < RELAYS_COUNT; i++) {
    JsonObject relay = relays.createNestedObject();
    relay["timeout"] = 0;
    if(Config.relays[i].timeout > 0 && relayTimeoutWhen[i] > 0) {
      relay["timeout"] = (relayTimeoutWhen[i] - millis()) / 1000;
    }
    relay["state"] = relayState[i];
    relay["flowMilliLitres"] = meters[i].flowMilliLitres;
    relay["totalMilliLitres"] = meters[i].totalMilliLitres;
    relay["flowRate"] = meters[i].flowRate;
  }

  String json;
  serializeJson(jsonDocument, json);

  return json;
}

