machv/esp8266-irrigator/src/main.cpp
void handle_api() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");

  server.send(200, "application/json", generateJsonApiResponse()); 
}

String generateHomepageHtml(){
  Serial.println("[HTTP] Sending homepage.");

  String ptr = "<!DOCTYPE html> <html>\n";
  ptr += "<head><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  ptr += "<title>Zavlažovač</title>\n";
  ptr += "<link href=\"/style.css\" type=\"text/css\" rel=\"stylesheet\"/>\n";
  ptr += "<script type=\"text/javascript\" src=\"scripts.js\"></script>\n";
  
  ptr += "<script type=\"text/javascript\">\n"
         "var timerSeconds, display;\n"
         "  window.onload = function () {\n";
  for(int i = 0; i < RELAYS_COUNT; i++) {
    if(Config.relays[i].timeout > 0 && relayTimeoutWhen[i] > 0) {
      unsigned long remainingSecondsTimer = (relayTimeoutWhen[i] - millis()) / 1000;
      ptr += ""
             "    timerSeconds = " + String(remainingSecondsTimer) + ";\n"
             "    display = document.querySelector('#r" + String(i) + "_timer');\n"
             "    intervals[" + String(i) + "] = startTimer(timerSeconds, display);\n";
    }
  }
  ptr += ""
         "    // start updating of the current UI values\n"
         "    refresher(5000);\n"
         "  };\n";
  ptr += "</script>\n";
  ptr += "</head>\n";
  ptr += "<body>\n<div class=\"page\">";
  ptr += "<h1>Irrigation</h1>\n";
  
  unsigned int frac;

  for(int i = 0; i< RELAYS_COUNT; i++) {
    ptr += "<div>";
    ptr += "<h2>" + Config.relays[i].name + "</h2>";

    //if(Config.relays[i].timeout > 0 && relayTimeoutWhen[i] > 0) {
    ptr += "<h3 id=\"r" + String(i) + "_timer\"></h3>";
    //}

    ptr += "<table>";
    ptr += "<tr>"
          "<td colspan=\"2\" id=\"r" + String(i) + "_state\" class=\"settings-cell relay-state\">";

    if(relayState[i] == true) {
      ptr += "ON";
    } else {
      ptr += "OFF";
    }
    ptr += "</td></tr>";

    ptr += "<tr>"
          "<td colspan=\"2\" class=\"settings-cell\">";

    if(relayState[i] == true) {
      ptr += "<a id=\"r" + String(i) + "_btn\" class=\"button button-on\" href=\"/toggle?id=" + String(i) + "\">Turn OFF</a>";
    } else {
      ptr += "<a id=\"r" + String(i) + "_btn\" class=\"button button-off\" href=\"/toggle?id=" + String(i) + "\">Turn ON</a>";
    }
    ptr += "</td></tr>";

    if(Config.relays[i].timeout > 0 && relayTimeoutWhen[i] > 0) {
      ptr += "<tr>"
          "<th>Timer off after:</th>"
          "<td id=\"r" + String(i) + "_timerWhen\">";
      ptr += millisToString(relayTimeoutWhen[i] - millis());
      ptr += "</td></tr>";
    }

      ptr += "<tr>"
          "<th>Flow rate:</th>"
          "<td><span id=\"r" + String(i) + "_flowRate\">";
    ptr += int(meters[i].flowRate); // Print the integer part of the variable
    ptr += "."; // Print the decimal point
    // Determine the fractional part. The 10 multiplier gives us 1 decimal place.
    frac = (meters[i].flowRate - int(meters[i].flowRate)) * 10;
    ptr += frac; // Print the fractional part of the variable
    ptr += "</span> L/min</td>"
           "</tr>"
           "<tr>"
           "<th>Current Liquid Flowing:</th>"
           "<td><span id=\"r" + String(i) + "_flowMilliLitres\">" + String(meters[i].flowMilliLitres) + "</span> mL/Sec</td>"
           "</tr>"
           "<tr>"
           "<th>Output Liquid Quantity:</th>"
           "<td><span id=\"r" + String(i) + "_totalMilliLitres\">" + String(meters[i].totalMilliLitres) + "</span> mL</td>"
           "</tr>";
    ptr += "</table>";
    ptr += "</div>";
  }
 
  ptr +="<hr>\n";
  ptr +="<a class=\"button\" href=\"/config\">Configuration</a>\n";

  ptr += "<p><form action='/restart' method='get' onsubmit='return confirm(\"Do you really want to restart the device?\");'>"
        "<button name='restart' class='button button-danger'>Restart</button></form></p>";

  ptr +="</div></body>\n";
  ptr +="</html>\n";
  return ptr;
}

void handle_pageConfig() {
  server.send(200, "text/html", generateSettingsHtml()); 
}

void handle_saveConfig() {
  String arg;
  arg = server.arg("mqtt_port");
  arg.trim();
  
  Config.mqtt_port = (arg.length() == 0 ? 1883 : arg.toInt());
  
  arg = server.arg("mqtt_server");
  arg.trim();
  Config.mqtt_server = arg;

  arg = server.arg("mqtt_user");
  arg.trim();
  Config.mqtt_user = arg; 

  arg = server.arg("mqtt_password");
  arg.trim();
  Config.mqtt_password = arg;

  String channel = server.arg("mqtt_channel_prefix");
  channel.trim();
  if(!channel.endsWith("/"))
    channel += "/";
  Config.mqtt_channel_prefix = channel;

  for(int i = 0; i < RELAYS_COUNT; i++) {
    arg = server.arg("relay_" + String(i) + "_timeout");
    arg.trim();
    Config.relays[i].timeout = (arg.length() == 0 ? 0 : arg.toInt());

    arg = server.arg("relay_" + String(i) + "_name");
    arg.trim();
    Config.relays[i].name = arg;
  }

  saveConfigurationFile();

  // Reconnect MQTT to reflect changes
  reconnectMqtt();

  server.sendHeader("Location", "/config?saved=1", true);
  server.send(303, "text/plain"); 
}

void handle_homepage() {
  server.send(200, "text/html", generateHomepageHtml()); 
}

void handle_restart() {
  server.send(200, "text/html", "<strong>Restarting the device...</strong>"); 
  delay(200);
  ESP.restart();
}

void handle_toggle() {
  if(!server.hasArg("id")) {
    server.send(400, "text/html", "Missing required parameter ID.");
    return;
  }

  int id = server.arg("id").toInt();
  if(id >= RELAYS_COUNT) {
    server.send(400, "text/html", "Invalid ID of relay was sent.");
    return;
  }

  toggleRelay(id);

  server.sendHeader("Location", "/");
  server.send(303, "text/plain");
}

// Callback function to be called when the button is pressed.
void onPressed1() {
	Serial.println("Button 1 has been pressed.");
  toggleRelay(1);
}

void onPressed2() {
	Serial.println("Button 2 has been pressed.");
  toggleRelay(2);
}

void meter0_triggered() {
  meters[0].pulseCounter++;

  Serial.printf("[FLOW] Flow meter 1 triggered, current counter = %d", meters[0].pulseCounter);
  Serial.println();
}
void meter1_triggered() {
  meters[1].pulseCounter++;

  Serial.printf("[FLOW] Flow meter 2 triggered, current counter = %d", meters[1].pulseCounter);
  Serial.println();
}

void meter_flowChanged(uint8_t pin) {
  int meterIndex = 0;
  bool meterFound = false;
  for(meterIndex = 0; meterIndex < RELAYS_COUNT; meterIndex++) {
    if(METER_PINS[meterIndex] == pin) {
      meterFound = true;
      break;
    }
  }

  if(!meterFound) {
    Serial.printf("[FLOW] Unable to find meter index for PIN %d", pin);
    Serial.println();

    return;
  }

  if(mqttClient.connected()) {
    String channelCurrent = String(Config.mqtt_channel_prefix + meterIndex + "/currentFlow");
    String valueCurrent = String(meters[meterIndex].flowRate);
    mqttClient.publish(channelCurrent.c_str(), valueCurrent.c_str());

    String channelTotal = String(Config.mqtt_channel_prefix + meterIndex + "/totalFlow");
    String valueTotal = String(meters[meterIndex].totalMilliLitres);
    mqttClient.publish(channelTotal.c_str(), valueTotal.c_str());
  }
}

void setup() {
  // For testing
  //SPIFFS.format();
  //WiFiManager.reset();

  // Set serial console Baud rate
  Serial.begin(115200);

